@libs = {}

@libs.forbiddenLastWords = [
  # ПРОСТРАНСТВЕННЫЕ ПРЕДЛОГИ
  'возле'
  'вокруг'
  'вдоль'
  'поперек'
  'близь'
  'из'
  'из-под'
  'около'
  'в'
  'во'
  'на'
  'под'
  'над'
  'между'

  # ВРЕМЕННЫЕ ПРЕДЛОГИ
  'после'
  'до'
  'среди'
  'через'
  'под'
  'подо'
  'перед между'
  'на'
  'при'

  # ПРИЧИННЫЕ ПРЕДЛОГИ
  'ради'
  'ввиду'
  'вследствие'
  'из-за'
  'из'
  'в силу'
  'благодаря'
  'согласно'

  # ЦЕЛЕВЫЕ ПРЕДЛОГИ
  'для'
  'ради'
  'в целях'
  'с целью'
  'к'
  'на'
  # ОБЪЕКТНЫЕ ПРЕДЛОГИ
  'по'
  'про'
  'о'
  'об'

  # АБЛАТИВНЫЕ ПРЕДЛОГИ
  'без'
  'безо'
  'кроме'
  'против'
  'от'
  'ото'
  'вместо'
  'вопреки'
  'за'

  # КОМИТАТИВНЫЕ ПРЕДЛОГИ
  'к'
  'ко'
  'с'
  'со'
  'при'

  # союзы
  'так'
  'как'
  'что'
  'потому'
  'только'
  'поэтому'
  'а'
  'да'
  'но'
  'или'
  'и'
  'также'
  'если'

  'чем'
  'затем',

  'которые',
  'который',
  'которого',
  'которая',
  'которое',
  'которому'
  'которой',
  'которую',
  'котором',
  'которой',
  'которым',
  'которых',

  'где',
  'когда',
  'очень',
  'не'
]